app/views/pages/explore.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
---
             <div class="col-sm-11 ">
                 <p class="post-title"><span class="post-owner"><%= User.find(@p.user_id).username %></span> - <span class="date-posted"> <%= @p.created_at.to_formatted_s(:short) %></span></p>